{
  "vocabularyList": [
    {
      "name": "環境",
      "description": "環境は、プロジェクト内の組織単位を表します。これは、開発、ステージング、本番などのコードのデプロイ環境に対応します。各プロジェクトには、同じフラグを異なる状態、ターゲット、およびルールで含む複数の環境を持つことができます。"
    },
    {
      "name": "エバリュエーション",
      "description": "エバリュエーションは、Bucketeer SDK がアプリケーションのコードからフラグと関連付けられたユーザーに関する情報を受け取るプロセスのことを指します。SDKは、そのユーザーに適したフラグバリエーションを返し、特定のユーザーまたはユーザーグループに対してフラグをエバリュエーションできるようにします。"
    },
    {
      "name": "エクスペリメント",
      "description": "Bucketeerにおけるエクスペリメントは、選択したユーザーへの特定の機能の影響を測定するために不可欠です。エクスペリメントは、フィーチャーフラグ、定義されたゴール、およびユーザーセグメントを組み合わせて、機能がこれらのゴール達成にどのように貢献するかを分析します。"
    },
    {
      "name": "フィーチャー",
      "description": "フィーチャーとは、アプリケーションの仕様または要素を指します。ボタン、画像、さらには購入フローやレコメンデーションアルゴリズムなどの複雑なコンポーネントなども含まれます。"
    },
    {
      "name": "フラグ",
      "description": "フラグは、Bucketeer における機能管理の基本単位です。さまざまな機能バリエーションを表し、各バリエーションにアクセスできるエンティティを決定するルールを含みます。エンティティは、アプリケーションのトラフィックの割合(%)、個人または共通の特徴を持つソフトウェアエンティティです。フラグと機能フラグは、Bucketeer ドキュメント内では同義語と見なされます。"
    },
    {
      "name": "ゴール",
      "description": "ゴールは、特定の指標に基づいて追跡と意思決定を行うために重要な指標です。クリック数、ページビュー数、または ウェブサイトでのユーザーエンゲージメントなど、コンバージョンやビジネス指標を表します。"
    },
    {
      "name": "イテレーション",
      "description": "イテレーションは、エクスペリメントが実行される定義された期間です。長さには制限がなく、同じエクスペリメントを複数回イテレーションしてデータを収集し、機能の影響を分析することが可能です。"
    },
    {
      "name": "メンバー",
      "description": "メンバーは、アカウントメンバーとも呼ばれ、組織内で Bucketeer を使用する人のことを指します。従業員、契約者、または Bucketeer 環境へのアクセス権を持つ個人です。"
    },
    {
      "name": "パーセンテージロールアウト",
      "description": "パーセンテージロールアウトは、特定のフラグバリエーションを指定された割合のコンテキストに徐々に公開するターゲティングルールです。このルールを使用すると、フラグの対象となる顧客の割合を段階的に増やして、100% が特定のバリエーションを受信するまでにすることが可能になります。"
    },
    {
      "name": "プロジェクト",
      "description": "プロジェクトは、Bucketeer アカウント内のフラグの組織単位を表します。これにより、フラグを希望の構造に基づいて整理できます。たとえば、会社が開発する各製品ごとにプロジェクトを作成することが可能です。プロジェクトには複数の環境を含めることができます。"
    },
    {
      "name": "ロール",
      "description": "ロールとは、Bucketeer内でのメンバーのアクセスレベルを定義するものです。ビルトインのロールには、閲覧者、編集者、所有者、管理者があり、それぞれBucketeer内の情報へのアクセスレベルが異なります。"
    },
    {
      "name": "SDK",
      "description": "Bucketeer SDK (Software Development Kit) は、Bucketeer をアプリケーションのコードと統合するためのツールとライブラリのセットです。SDK を初期化し、フィーチャーフラグをエバリュエーションし、各顧客に適したフラグバリエーションを取得することが可能です。"
    },
    {
      "name": "ユーザーセグメント",
      "description": "ユーザーセグメントは、比較やテストを目的として定義されたユーザーのグループです。Bucketeer では、異なる方法でユーザーセグメントを構成できるため、さまざまなユーザーエクスペリエンスを提供したり、ユーザーのサブセットでベータ機能をテストしたりすることが可能です。"
    },
    {
      "name": "バリエーション",
      "description": "フィーチャーフラグは、アプリケーション内の特定の機能の表示を管理し、特定のユーザーに対してアクティブ化したり、トラフィックの一部に対してロールアウトしたりすることができます。これらのフィーチャーフラグは、その機能で利用可能なさまざまなオプションまたは構成を表すバリエーションで構成されています。Bucketeer では、バリエーションはフラグの可能な値を表し、機能のさまざまなオプションと状態を定義します。バリエーションは、ブールフラグの場合はバイナリ (例：true/false) で、多変量フラグの場合は複数のオプションを持つことができます。各オプションは同じタイプの値 (文字列など) を持ち、名前と説明を付加することが可能です。"
    }
  ]
}